/**
 *  XXX: 核心的意义是左手资本利得，右手红利，做到合适的时候就是沉入海底的时候
 *  但是出发点永远是内在股东回报，只是内在股东回报或许没有那么多合适的机会
 *  筛选指标从哪些入手
 *  1. 绝对低估值 pB<2
 *  2. 企业本身有长期特性而处于周期低点 ROE>15%
 * 1. 战略参考资料：https://doc.zsxq.com/newuser/planetmaster.html
 * 2. 一些KOC的案例思考，我可以借鉴和参考哪些，我的核心价值是什么，我如何维护社群以及保证用户粘性
 *  2.1 哈利为什么做的起来，他的核心价值是什么（80-100W）
 *    大量的框架化的企业分析
 *    给出定量视角的后视镜复盘，好像给了迷茫散户的救生船（可操作？）
 *    公域算法流量支持，在2022年左右实现了用户积累
 *  2.2 启四为什么做的起来，他的核心价值是什么（150W）
 *    将可转债结构化，体系化的讲清楚，在细分领域
 *    提高可套利的薅羊毛业务，用户可以操作（光理论分享还是过于曲高和寡）
 *  2.3 为什么高股息之家能做起来，有什么核心价值 (GMV数据不可见)
 *    用户可以跟随着操作，加之价值观领域的内容输出，就产生了流量价值与跟随价值
 *    至于写的那些企业分析，巴芒文章，它只能吸引同频的人，很难产生付费价值
 *  2.3 为什么佐罗深度难以做大（12-15W）
 *    1. 要说核心价值，我会说佐罗更有意义，但是在社群价值层面就远比不上前二者
 *    2. 哈利给了买入/卖出的定量理解，当然不一定对，但是后视镜看有概率碰对，所以有用户
 *    3. 启四讲了可转债和套利，用户能跟着做，对错都是概率和细节的交付
 *  2.4 财报是一本故事书为什么做不起来（）
 *    1. 内容对错不去分析，用户看了没法跟着操作，就没有用户粘性
 *    2. 还是过于价值狭隘，存粹内容写作赛道很难
 *
 *
 *
 *
 */

/**
 * 1. 核心内容体系是什么
 *  1.1 巴芒资料分享：股东信，股东大会，其它人解读
 *  1.2 其它优秀投资人资料分享：散户乙，李录，优秀基金经理等
 *  1.3 企业资料，财报分析等
 *  1.4 逆熵增，人生能量，认知提高
 *  1.5 估计是一些社群运作，不同平台运营的事情（借助AI,软件能力差异化产品）
 *    1. 大地任我行知识体系
 *    2. 养股知识体系
 *  1.6 10年前100万持有xxx到现在，收益可视化分析
 *
 *
 *
 */
