/**
 * 1. 商业领域的现实思考
 *  1.1 技术领域到底该怎么走，没有护城河的行业
 *    1.1.1 结论：web2领域的技术没有护城河，更应该锚定商业选择细分领域的垂直赛道（注意不是从众心理）
 *      何谓没有护城河：技术实现大家都能快速学习并实现，早期上升空间合适混大厂，混title还有增量，现在而言现金流收益太低（核心矛盾）
 *      这句话不完全，工作不能丢的当下寻找base增加，工时合理，能做一段时间的工作（耐心寻找细分赛道，抓不变的部分）
 *      行为指导：锚定自己的目标，思考清楚会得到什么，会丢掉什么，哪些有性价比，哪些是无意义的
 *    1.1.2 web3有机会吗
 *      1. 从技术参与的角度，没有什么机会，应用层的实现门槛太低，工程师红利这始终不是一个好的商业行为
 *      2. 赛道机会：一个上升期或者有突出商业价值的赛道，除了技术参与还有很多维度，你可以提供工具，卖铲子等一系列商业化行为
 *    1.1.3 AI领域
 *      1. 这个思路同样适用于AI领域，也适用于各种有突出行业需求，流量波动明显的领域
 *      2. 核心能力是输出体系化，结构化，能打造课程和产品闭环形成商业化，这就要求有强大的输入和输出能力，以及商业化能力，这些是恒久的护城河。
 *      3. 最终能带你实现进阶的满足两个条件，在核心能力点支持的情况下，要不是赛道增量明显，要不是有兴趣支撑可以坚持长期主义。
 *    1.1.4 综合视野（其它商业领域）
 *      1. 还是要多阅读，多链接资源从而保持敏感性，商业世界不仅仅局限于互联网行业，一定存在很多细分的垂直赛道可以支持商业化行为
 *      2. 工作本身在不同阶段有不同的意义，平常心就是有得有失，哪有很好的工作呢！
 *
 *
 *
 *
 *
 */
