/**
 * @description C端营销体系下，H5场景的多端适配
 *  1. 跨端方案的原理
 *    1.1 什么是运行时和编译时
 *       编译时：一般来说定义成构建编译，也就是生成目标产物，对于传统的web项目，主要就是js/css等静态资源
 *              满足对宿主语法兼容，之后具体的渲染过程交给宿主环境（这里的编译和开发语言层面的编译不同但名次介绍也相似）
 *              编译目标的差异取决于宿主环境，一般是借助AST,其实也是分层的思想
 *       运行时：一般来说满足三个场景1. 程序运行的时候；2.运行是时候的环境和必要的库
 *  2. 应用跨端体系的常见业务场景&业务诉求
 *     2.1 小程序本身能力支持跨端和业界典型方案调研
 *
 */








/**
 * 参考阅读
 * https://juejin.cn/post/6918881497264947207（可视化拖拽技术系统介绍）
 * https://www.yuque.com/alsmile/topology/daf7sb（综合生态体系）
 * @description 类似营销H5业务的可视化搭建
 *  1. 可视化技术架构和关键技术解析
 *    1.1 业务场景&商业价值
 *
 *
 */
